from webdriver_manager.chrome import ChromeDriverManager 
from selenium import webdriver
from selenium.webdriver.common.by import By
from selenium.webdriver.chrome.service import Service
from selenium.common.exceptions import NoSuchElementException
import time 
import pandas as pd
from openpyxl import Workbook
# openpyxl  : 엑셀파일을 읽고 쓸수있는 기능 제공

original_list = [
    "식품_과일", "식품_견과_건과", "식품_채소","식품_쌀_잡곡", "식품_축산_계란","식품_수산물_건어물","식품_생수_음료","식품_커피_원두_차","식품_과자_초콜릿_시리얼","식품_면_통조림_가공식품","식품_가루_조미료_오일","식품_장_소스_드레싱_식초","식품_유제품_아이스크림","식품_냉장_냉동_간편요리","식품_건강식품",
    "선물세트관","반찬간편식대용식","곤약방탄커피외","분유어린이식품",
    "생활용품_헤어", "생활용품_바디_세안","생활용품_구강_면도","생활용품_화장지_물티슈","생활용품_생리대_성인기저귀","생활용품_기저귀","생활용품_세탁세제","생활용품_청소_주방세제","생활용품_탈취_방향제_살충제","생활용품_건강_의료용품","생활용품_세탁_청소용품",
    "생활용품_욕실용품","생활용품_생활전기용품","생활용품_수납_정리","생활용품_주방수납_잡화",
    "뷰티_럭셔리", "뷰티_스킨케어", "뷰티_클린_비건뷰티", "뷰티_클렌징_필링", "뷰티_더마코스메틱", "뷰티_메이크업", "뷰티_향수", "뷰티_남성화장품", "뷰티_네일", "뷰티_소품","뷰티_어린이화장품","뷰티_로드샵", "뷰티_헤어","뷰티_바디","뷰티_선물세트_키트",
    "여름침구샵","인테리어_싱글하우스","인테리어_홈데코","인테리어_가구","인테리어_수납정리","인테리어_침구","인테리어_커튼_블라인드","인테리어_카페트_쿠션_거실화","인테리어_수예_수선",
    "인테리어_욕실용품","인테리어_조명_스탠드","인테리어_셀프","인테리어_원예_가드닝","인테리어_생활전기용품","인테리어_공구_철물_DIY","인테리어_안전_호신용품","인테리어_세탁_청소용품",
    "TV_영상가전","냉장고","세탁기_건조기","생활가전","청소기","계절가전","뷰티_헤어가전","건강가전","주방가전",
    "노트북","데스크탑","모니터","휴대폰","태플릿PC","스마트워치",
    "게임","키보드_마우스","저장장치","프린터_복합기","PC부품",
    "PC주변기기","음향기기","카메라","전동킥보드_자전거","차량용디지털",
    "1인방송전문관","휴대폰악세서리",
    "주방용품_주방가전","냄비_프라이팬","주방조리도구","그릇_홈세트","수저_커트러리","컵_텀블러_와인용품","주전자_커피_티용품","주방수납_정리","밀폐저장_도시락","주방잡화","일회용품_종이컵","보온_보냉용품","1인가구주방용품",
    "출산유아패션", "기저귀", "출산유아물티슈", "분유어린이식품", "출산유아어린이건강식품", "수유용품","이유용품_유아식기","출산유아_매트안전용품","유모차_웨건","출산유아_카시트","아기띠_외출용품",
    "출산유아_욕식용품_스킨케어","출산유아_위생_건강_세제","유아동침구","유아가구_인테리어","유아완구_교구","출산준비물_선물","임부_태교용품",
    "강아지사료", "강아지간식","강아지영양제","강아지용품",
    "고양이사료", "고양이간식","고양이영양제","고양이용품",
    "펫티켓산책용품","관상어용품","소동물가축용품",
    "완구취미_캐릭터별완구", "완구취미_신생아영아완구","완구취미_로봇작동완구","완구취미_역할놀이","완구취미_블록놀이","완구취미_인형","완구취미_물놀이계절완구","완구취미_승용완구","완구취미_스포츠야외완구",
    "완구취미_실내대형완구","완구취미_STEAM완구","완구취미_학습완구교구","완구취미_보드게임","완구취미_RC완구부품","완구취미_퍼즐큐브피젯토이",
    "완구취미_프라모델","완구취미_피규어다이캐스트","완구취미_콘솔휴대용게임기","완구취미_파티마술용품","완구취미_DIY","완구취미_악기음향기기","완구취미_원예가드닝","완구취미_수집품","완구취미_연령별완구","완구취미_키덜트샵",
    "자동차용품_봄철차량관리", "자동차용품_인테리어","자동차용품_익스테리어","자동차용품_세차카케어","자동차용품_차량용전자기기","자동차용품_차량관리소모품","자동차용품_RV아웃도어","자동차용품_부품안전공구","자동차용품_오토바이","자동차용품_로켓설치타이어",
    "사무용품전문관", "미술화방용품","캐릭터문구","학용품수업준비","필기류","노트메모지","다이어리플래너","바인더파일",
    "파티이벤트","데코포장용품","카드엽서봉투","앨범","복사용품라벨지","보드칠판광고",
    "캠핑전문관","홈트레이닝","수영수상스포츠","골프","자전거","킥보드스케이트","낚시","등산아웃도어","스포츠신발","남성스포츠의류","여성스포츠의류","유아스포츠의류","스포츠잡화","구기스포츠","라켓스포츠","헬스요가댄스","복싱검도태권도","기타스포츠","스키겨울스포츠",
    "건강기능식품","성인용건강식품","여성용건강식품","남성용건강식품","임산부건강식품","시니어건강식품","어린이건강식품","비타민미네랄","영양제","허브식물추출물","홍삼인삼","건강즙음료","꿀프로폴리스","건강분말건강환","헬스보충식품","다이어트이너뷰티","홈트레이닝","헬스요가용품","건강가전","건강도서","건강의료용품","곤약방탄커피외","샐러드닭가슴살",
    "유아어린이","소설에세이시","초중고참고서","가정살림", "건강취미","경제경영","과학공학","국어외국어사전","대학교재","만화라이트노벨", "사회정치", "수험서자격증", "여행", "역사", "예술", "인문", "자기계발", "잡지", "종교", "청소년", "해외도서", "IT컴퓨터", "CDLP", "DVD블루레이", 
    "여성패션", "남성패션", "유아동패션", "남녀공용패션"
]


product_code = {
    '식품_과일': 194282,'식품_견과_건과': 194373, '식품_채소': 194432,'식품_쌀_잡곡':  194627,'식품_축산_계란': 194688,'식품_수산물_건어물': 194829,'식품_생수_음료': 195006, '식품_커피_원두_차':195142, '식품_과자_초콜릿_시리얼':195266, '식품_면_통조림_가공식품':195443, '식품_가루_조미료_오일':195576,'식품_장_소스_드레싱_식초':195694,'식품_유제품_아이스크림':195783,'식품_냉장_냉동_간편요리':225461,'식품_건강식품':196076,
    '분유어린이식품':  196236,'선물세트관':  196393,'반찬간편식대용식':  432480,'곤약방탄커피외': 492629,
    '생활용품_헤어': 123111, '생활용품_바디_세안': 509357,'생활용품_구강_면도': 114471,'생활용품_화장지_물티슈': 465071,'생활용품_생리대_성인기저귀':465072,'생활용품_기저귀': 502258,'생활용품_세탁세제': 399742,'생활용품_청소_주방세제': 399758,'생활용품_탈취_방향제_살충제':114472, '생활용품_건강_의료용품':114473, '생활용품_세탁_청소용품': 225844,
    '생활용품_욕실용품':419509, '생활용품_생활전기용품':399909,'생활용품_수납_정리': 114727,'생활용품_주방수납_잡화': 105903,
    '뷰티_럭셔리': 18530,'뷰티_스킨케어': 176530,'뷰티_클린_비건뷰티': 509393,'뷰티_클렌징_필링':  486551,'뷰티_더마코스메틱': 7642,'뷰티_메이크업': 176573, '뷰티_향수':176598,'뷰티_남성화장품': 176839,'뷰티_네일': 176763,'뷰티_소품': 176807,'뷰티_어린이화장품':  403012,'뷰티_로드샵': 4999, '뷰티_헤어':176602,'뷰티_바디': 176699,'뷰티_선물세트_키트': 176963,
    '여름침구샵': 388647, '인테리어_싱글하우스': 413976,'인테리어_홈데코': 417542, '인테리어_가구':184557, '인테리어_수납정리': 184791,'인테리어_침구': 400472, '인테리어_커튼_블라인드':  185101, '인테리어_카페트_쿠션_거실화':  185150, '인테리어_수예_수선':  400554,
    '인테리어_욕실용품':419692,'인테리어_조명_스탠드': 407567, '인테리어_셀프':280701, '인테리어_원예_가드닝':384621,'인테리어_생활전기용품': 510083,'인테리어_공구_철물_DIY': 510113, '인테리어_안전_호신용품': 510239,'인테리어_세탁_청소용품': 510332,
    '계절가전': 227812,'뷰티_헤어가전':  333478,'건강가전': 178713,'주방가전': 445736,
    'TV_영상가전': 178454, '냉장고':403245,'세탁기_건조기': 486733,'생활가전': 178627, '청소기': 413352, 
    '노트북': 497135,'데스크탑': 497136, '모니터':510541, '휴대폰':497244,'태플릿PC': 497245,'스마트워치':497252,
    '게임':395267,'키보드_마우스': 497142,'저장장치': 497159,'프린터_복합기': 497181,'PC부품': 497198,
    'PC주변기기':497220, '음향기기':178399,'카메라': 178548,'전동킥보드_자전거': 497256, '차량용디지털':178489,
    '1인방송전문관':429603,'휴대폰악세서리': 497261,
    '주방용품_주방가전': 186504, '냄비_프라이팬': 185671,'주방조리도구': 185976,'그릇_홈세트': 185735,'수저_커트러리': 185823,'컵_텀블러_와인용품':185797, '주전자_커피_티용품':186412,'주방수납_정리': 186147,'밀폐저장_도시락': 185872, '주방잡화':399678,'일회용품_종이컵': 186260, '보온_보냉용품': 185955, '1인가구주방용품':429840,
    '출산유아패션': 508565, '기저귀': 485952,'출산유아물티슈': 485979,'분유어린이식품':  221939,'출산유아어린이건강식품':  509025,'수유용품': 221943,'이유용품_유아식기':  334841,'출산유아_매트안전용품':  221946,'유모차_웨건':  381650, '출산유아_카시트':381697, '아기띠_외출용품':381717,
    '출산유아_욕식용품_스킨케어':221944, '출산유아_위생_건강_세제':221945,'유아동침구': 221942,'유아가구_인테리어': 221947,'유아완구_교구': 349657,'출산준비물_선물':418893,'임부_태교용품':221950,
    '강아지사료': 445725, '강아지간식': 118900,'강아지영양제': 486318, '강아지용품':118876,
    '고양이사료': 445859, '고양이간식': 119402,'고양이영양제': 486331, '고양이용품':118878,
    '펫티켓산책용품': 381522,'관상어용품':  118879,'소동물가축용품': 121391,
    '완구취미_캐릭터별완구':  1916, '완구취미_신생아영아완구':  331793, '완구취미_로봇작동완구':  331852,'완구취미_역할놀이':  331940,'완구취미_블록놀이':  331900, '완구취미_인형':  331915,'완구취미_물놀이계절완구':  332817,'완구취미_승용완구':  332642,'완구취미_스포츠야외완구':  332699,
    '완구취미_실내대형완구':  332629,'완구취미_STEAM완구': 373941,'완구취미_학습완구교구':  331991,'완구취미_보드게임':  332230, '완구취미_RC완구부품':  332380,'완구취미_퍼즐큐브피젯토이':  332324,
    '완구취미_프라모델':  332492, '완구취미_피규어다이캐스트':  332576, '완구취미_콘솔휴대용게임기':  402347, '완구취미_파티마술용품':  332852, '완구취미_DIY':  332884 ,'완구취미_악기음향기기':  333022, '완구취미_원예가드닝': 384521, '완구취미_수집품': 384343, '완구취미_연령별완구':  872, '완구취미_키덜트샵':  4659,
    '자동차용품_봄철차량관리': 414817, '자동차용품_인테리어': 401027,'자동차용품_익스테리어': 401098, '자동차용품_세차카케어': 401394, '자동차용품_차량용전자기기': 401207,'자동차용품_차량관리소모품': 486447,'자동차용품_RV아웃도어':  503300,'자동차용품_부품안전공구': 497290, '자동차용품_오토바이':401438,'자동차용품_로켓설치타이어': 10884,
    '사무용품전문관':  408063,'미술화방용품': 401900,'캐릭터문구':  359731,'학용품수업준비':  178098,'필기류':  177297,'노트메모지':  401541,'다이어리플래너': 401572,'바인더파일':  177419,
    '파티이벤트':  401805,'데코포장용품':  178035,'카드엽서봉투':  178005,'앨범':  401781,'복사용품라벨지':  177453,'보드칠판광고': 401787,
    '캠핑전문관':  328790,'홈트레이닝':  413812,'수영수상스포츠':  421032,'골프':  328930,'자전거':  329040,'킥보드스케이트':329189,'낚시': 329372,'등산아웃도어':431783,'스포츠신발':328601,'남성스포츠의류':328339,'여성스포츠의류':328435,'유아스포츠의류':328542,'스포츠잡화':328637,'구기스포츠': 329515,'라켓스포츠':400957,'헬스요가댄스':329225,'복싱검도태권도':329726,'기타스포츠':329927,'스키겨울스포츠':329757,
    '건강기능식품':6585,'성인용건강식품':10288,'여성용건강식품':10289,'남성용건강식품':10290,'임산부건강식품':10291,'시니어건강식품':10292,'어린이건강식품':501398,'비타민미네랄':310632,'영양제':310655,'허브식물추출물':310694,'홍삼인삼':311209,'건강즙음료':311219,'꿀프로폴리스':501440,'건강분말건강환':501446,'헬스보충식품':310722,'다이어트이너뷰티':310745,'홈트레이닝':501452,'헬스요가용품':334193,'건강가전':310834,'건강도서':310856,'건강의료용품':310885,'곤약방탄커피외':501555,'샐러드닭가슴살':502133,
    '유아어린이': 329984,'소설에세이시': 330184,'초중고참고서':  331062,'가정살림':  330112,'건강취미':  330320,'경제경영':  330255,'과학공학':  330795,'국어외국어사전':  330972,'대학교재':  331100,'만화라이트노벨':  330646,'사회정치':  330585,
    '수험서자격증':  331298,'여행':  330379,'역사':  330521,'예술':  330674,'인문':  330479,'자기계발':  330304,'잡지':  330436,'종교':  330732,'청소년':  330100,'해외도서':  335889,'IT컴퓨터':  330855,'CDLP':  394468,'DVD블루레이' : 401489,
    '여성패션': 186764, '남성패션': 187069, '유아동패션': 213201, '남녀공용패션': 502993
    }


url_list = [] 
for lis in original_list:
    key = str(product_code[lis])
    raw_url = f"https://www.coupang.com/np/categories/{key}?listSize=120&brand=&offerCondition=&filterType=&isPriceRange=false&minPrice=&maxPrice=&page=1"
    url_list.append(raw_url)
    
options = webdriver.ChromeOptions()
# options.add_argument("--headless")
options.add_argument("authority=" + "www.coupang.com")
options.add_argument("method=" + "GET")
options.add_argument("accept=" + "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9")
options.add_argument("accept-encoding=" + "gzip, deflate, br")
options.add_argument("user-agent=" + "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/98.0.4758.104 Whale/3.13.131.36 Safari/537.36")
options.add_argument("sec-ch-ua-platform=" + "macOS")
options.add_argument("cookie=" + "PCID=31489593180081104183684; _fbp=fb.1.1644931520418.1544640325; gd1=Y; X-CP-PT-locale=ko_KR; MARKETID=31489593180081104183684; sid=03ae1c0ed61946c19e760cf1a3d9317d808aca8b; x-coupang-origin-region=KOREA; x-coupang-target-market=KR; x-coupang-accept-language=ko_KR;")


for name, main_url in zip(original_list, url_list) : 
    print("*" * 50 + " " + f"{name}시작하겠습니다." + " " + "*" * 50)
    
    driver = webdriver.Chrome(service=Service(ChromeDriverManager().install()), options=options)   
    driver.get(main_url)
    time.sleep(10)
    print("*" * 50 + " " + name + " Page start!" + " " + "*" * 50)

    wb = Workbook()
    ws = wb.create_sheet(name)
    wb.remove_sheet(wb["Sheet"])
    ws.append(["상품명", "가격", "이미지", "상세URL"]) 

    try :
        product = driver.find_element(By.ID, "productList")
        lis = product.find_elements(By.CLASS_NAME, "baby-product")

        for li in lis:
            try : 
                product = li.find_element(By.CLASS_NAME, "name").text
                price = li.find_element(By.CLASS_NAME, "price-value").text
                image = li.find_element(By.CSS_SELECTOR, "dl > dt > img").get_attribute("src")
                product_url = li.find_element(By.CLASS_NAME, "baby-product-link").get_attribute("href")
                ws.append([product, price, image, product_url])
                print("product : ", product)
                print("price : ", price)
                print("image : ", image)
                print("url : ", product_url)
            except Exception:
                pass 
        print("*" * 50 + " " + name + " Page end!" + " " + "*" * 50)
        time.sleep(5)
        wb.save(f"D:\BTEAM_2/{name}_page.xlsx")
        wb.close()
        
        driver.quit()

    except NoSuchElementException :
        print("에러가 발생하여 정상적으로 데이터가 수집되지 않았습니다.")
    

print(f"*" * 50 + "모든 데이터 수집을 마쳤습니다. 감사합니다. " + " " + "*" * 50)











